rr3511/ram/ADS131M08_interface_stm32.c
/**
 * \copyright Copyright (C) 2019 Texas Instruments Incorporated - http://www.ti.com/
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *
 *    Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the
 *    distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include "ads131m0x.h"
#include "stm32f1xx_hal.h"
#include "stm32f1xx_it.h"
#include "string.h"
#include "gpio.h"
#include <stdlib.h>
//****************************************************************************
//
// Internal variables
//
//****************************************************************************
_adcConfM* adcConfM = NULL;
_ADS131M08_ch ch;
#define SPI_DEFAULT_TIMEOUT 100U

//****************************************************************************
//
// Internal function prototypes
//
//****************************************************************************
//
//uint8_t     buildSPIarray(const uint16_t opcodeArray[], uint8_t numberOpcodes, uint8_t byteArray[]);
//uint16_t    enforce_selected_device_modes(uint16_t data);
//uint8_t     getWordByteLength(void);
uint16_t getRegisterValue(uint8_t address);
HAL_StatusTypeDef ADS131M08_send_command(uint16_t cmd, uint16_t addr, uint16_t regs);
HAL_StatusTypeDef ADS131M08_recv_response(uint16_t cmd, uint16_t addr, uint16_t regs, _sendFlg sendFlg);
extern void ADS131M08_control_cs_signal(_signalState onOff);
extern GPIO_PinState ADS131M08_read_cs_signal();
void restoreRegisterDefaults(void);
extern uint8_t ADS131M08_wait_drdy_int(const uint32_t timeout_10ms);
HAL_StatusTypeDef ADS131M08_startup();
float ADS131M08_convert_to_mVolt(uint32_t reg);
void delay_us(uint32_t microseconds);
void toggleRESET(void);
uint8_t confirmBuf[2];
//*****************************************************************************
//
//! Getter function to access registerMap array from outside of this module.
//!
//! \fn uint16_t getRegisterValue(uint8_t address)
//!
//! NOTE: The internal registerMap arrays stores the last know register value,
//! since the last read or write operation to that register. This function
//! does not communicate with the device to retrieve the current register value.
//! For the most up-to-date register data or retrieving the value of a hardware
//! controlled register, it is recommend to use readSingleRegister() to read the
//! current register value.
//!
//! \return unsigned 16-bit register value.
//
//*****************************************************************************
uint16_t getRegisterValue(uint8_t address)
{
    assert(address < NUM_REGISTERS);
    return adcConfM->sr.mp[address];
}

//*****************************************************************************
//
//! Example start up sequence for the ADS131M0x.
//!
//! \fn void adcStartup(void)
//!
//! Before calling this function, the device must be powered,
//! the SPI/GPIO pins of the MCU must have already been configured,
//! and (if applicable) the external clock source should be provided to CLKIN.
//!
//! \return None.
//
//*****************************************************************************







HAL_StatusTypeDef ADS131M08_init(_adcType adcType, SPI_HandleTypeDef* hspi)
{
    HAL_StatusTypeDef result = HAL_OK;
    _adcConfM* adcConf;

    if(adcType == ADS131M08_ADC1)
    {
        adcConfM  = (_adcConfM*)malloc(sizeof(_adcConfM));
        memset(adcConfM, 0, sizeof(_adcConfM));
        adcConfM->type            = adcType;
        adcConfM->stat            = ADS131M08_INIT;
        adcConfM->hspi            = hspi;
        adcConfM->nReset.port     = SYNC_RESET_GPIO_Port;
        adcConfM->nReset.pin      = SYNC_RESET_Pin;
        adcConfM->cs.port         = CS_GPIO_Port;
        adcConfM->cs.pin          = CS_Pin;
        adcConfM->nDrdy.port      = DRDY_GPIO_Port;
        adcConfM->nDrdy.pin       = DRDY_Pin;
        adcConfM->bufLen          = M08_WORDS_IN_FRAME * M08_WORD_LENGTH;      // 9 Words x 24 Bits
        adcConfM->rxBuf           = (uint8_t*)malloc(adcConfM->bufLen);
        memset(adcConfM->rxBuf, 0, adcConfM->bufLen);
        adcConfM->txBuf           = (uint8_t*)malloc(adcConfM->bufLen);
        memset(adcConfM->txBuf, 0, adcConfM->bufLen);

        adcConf = adcConfM;
    }
    else
    {
        result = HAL_ERROR;
        return result;
    }

    // Reset Sequence
    HAL_GPIO_WritePin(adcConf->cs.port, adcConf->cs.pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(adcConf->nReset.port, adcConf->nReset.pin, GPIO_PIN_RESET);

    result = ADS131M08_startup();

    if(result == HAL_OK)
    {
        adcConf->stat = ADS131M08_NORMAL;
    }
    else
    {
        adcConf->stat = ADS131M08_INIT_FAIL;
    }

    return result;
}


HAL_StatusTypeDef ADS131M08_startup()

{
	int i=0;
	uint16_t regs=0;
	/* (OPTIONAL) Provide additional delay time for power supply settling */
	HAL_Delay(50);

	/* (REQUIRED) Set nRESET pin high for ADC operation */
    HAL_GPIO_WritePin(adcConfM->nReset.port, adcConfM->nReset.pin, GPIO_PIN_SET);

	/* (OPTIONAL) Toggle nRESET pin to ensure default register settings. */
	/* NOTE: This also ensures that the device registers are unlocked.	 */
	toggleRESET();

    /* (REQUIRED) Initialize internal 'registerMap' array with device default settings */
	restoreRegisterDefaults();

    /* (OPTIONAL) Validate first response word when beginning SPI communication: (0xFF20 | CHANCNT) */
	 ADS131M08_send_command(ADS131M08_CMD_NULL, 0, 0);
	 ADS131M08_send_command(ADS131M08_CMD_UNLOCK, 0, 0);

