rr3511/ram/ADS131M08_interface_stm32.c
	    if(HAL_OK != ADS131M08_recv_response(ADS131M08_CMD_UNLOCK, 0, 0, SEND_SYSTEM_CMD))
	    {
	        return HAL_ERROR;
	    }

	    ADS131M08_send_command(ADS131M08_CMD_WAKEUP, 0, 0);

	    if(HAL_OK != ADS131M08_recv_response(ADS131M08_CMD_WAKEUP, 0, 0, SEND_SYSTEM_CMD))
	    {
	        return HAL_ERROR;
	    }
	/* (OPTIONAL) Define your initial register settings here */
	    regs=(CLOCK_DEFAULT & ~CLOCK_OSR_MASK);
	    regs|=CLOCK_OSR_256;
       ADS131M08_send_command(ADS131M08_CMD_WREG,CLOCK_ADDRESS, regs);
	    if(HAL_OK != ADS131M08_recv_response(ADS131M08_CMD_RREG, CLOCK_ADDRESS, 0, SEND_REGISTER_CMD))
	    {
	        return HAL_ERROR;
	    }
    /* (REQUIRED) Configure MODE register settings
     * NOTE: This function call is required here for this particular code implementation to work.
     * This function will enforce the MODE register settings as selected in the 'ads131m0x.h' header file.
     */
       ADS131M08_send_command(ADS131M08_CMD_WREG,MODE_ADDRESS, MODE_DEFAULT);

    /* (OPTIONAL) Read back all registers */
    // Wakeup device


    // Ignore the first 5 conversion results to allow for the
    // output buffers to fill-up and the SINC3 filter to settle
    for(i = 0; i < 5; i++)
    {
        ADS131M08_wait_drdy_int(100);
        ADS131M08_control_cs_signal(RESET_SIGNAL);
        HAL_SPI_Receive(adcConfM->hspi, adcConfM->rxBuf, adcConfM->bufLen, SPI_DEFAULT_TIMEOUT);
        ADS131M08_control_cs_signal(SET_SIGNAL);
    }

    return HAL_OK;
	/* (OPTIONAL) Check STATUS register for faults */
}

//*****************************************************************************
//
//! Toggles the "nSYNC/nRESET" pin to trigger a reset
//! (LOW, delay 2 ms, then HIGH).
//!
//! \fn void toggleRESET(void)
//!
//! \return None.
//
//*****************************************************************************
void toggleRESET(void)
{
    /* --- INSERT YOUR CODE HERE --- */
    HAL_GPIO_WritePin(adcConfM->nReset.port, adcConfM->nReset.pin, GPIO_PIN_RESET);

    // Minimum /RESET pulse width (tSRLRST) equals 2,048 CLKIN periods (1 ms @ 2.048 MHz)
    HAL_Delay(2);

    HAL_GPIO_WritePin(adcConfM->nReset.port, adcConfM->nReset.pin, GPIO_PIN_SET);
    // tREGACQ delay before communicating with the device again
    delay_us(5);

    // NOTE: The ADS131M0x's next response word should be (0xFF20 | CHANCNT).
    // A different response may be an indication that the device did not reset.

    // Update register array
  //  restoreRegisterDefaults();

    // Write to MODE register to enforce mode settings

}





//*****************************************************************************
//
//! Sends the specified SPI command to the ADC (NULL, STANDBY, or WAKEUP).
//!
//! \fn uint16_t sendCommand(uint16_t opcode)
//!
//! \param opcode SPI command byte.
//!
//! NOTE: Other commands have their own dedicated functions to support
//! additional functionality.
//!
//! \return ADC response byte (typically the STATUS byte).
//
//*****************************************************************************

HAL_StatusTypeDef ADS131M08_send_command(uint16_t cmd, uint16_t addr, uint16_t regs)
{
    HAL_StatusTypeDef result = HAL_OK;
    _sendFlg sendFlg = SEND_SYSTEM_CMD;
    GPIO_PinState pinStat = GPIO_PIN_RESET;

    switch(cmd)
    {
        case ADS131M08_CMD_NULL:
        case ADS131M08_CMD_RESET:
        case ADS131M08_CMD_STANDBY:
        case ADS131M08_CMD_WAKEUP:
        case ADS131M08_CMD_LOCK:
        case ADS131M08_CMD_UNLOCK:
            adcConfM->txBuf[0] = ADS131M08_UPPER(cmd);
            adcConfM->txBuf[1] = ADS131M08_LOWER(cmd);
            adcConfM->txBuf[2] = 0;
            adcConfM->txBuf[3] = 0;
            adcConfM->command = cmd;
            adcConfM->regAddr = 0;

            sendFlg = SEND_SYSTEM_CMD;
            break;

        case ADS131M08_CMD_RREG:    // ADS131A04_CMD_RREGS
            adcConfM->txBuf[0] = ADS131M08_UPPER(ADS131M08_REG_COMMAND(cmd,addr));
            adcConfM->txBuf[1] = ADS131M08_LOWER(ADS131M08_REG_COMMAND(cmd,addr));
            adcConfM->txBuf[2] = 0;
            adcConfM->txBuf[3] = 0;
            adcConfM->command = cmd;
            adcConfM->regAddr = addr;
            adcConfM->regs = regs;

            sendFlg = SEND_REGISTER_CMD;
            break;
        case ADS131M08_CMD_WREG:
            adcConfM->txBuf[0] = ADS131M08_UPPER(ADS131M08_REG_COMMAND(cmd,addr));
            adcConfM->txBuf[1] = ADS131M08_LOWER(ADS131M08_REG_COMMAND(cmd,addr));
            adcConfM->txBuf[2] = ADS131M08_UPPER(regs);
            adcConfM->txBuf[3] = ADS131M08_LOWER(regs);
            adcConfM->command = cmd;
            adcConfM->regAddr = addr;
            adcConfM->regs = regs;
            adcConfM->sr.mp[addr] = regs;

            sendFlg = SEND_REGISTER_CMD;
            break;
        default:
            break;
    }

    // Check availablity to send data

    while(GPIO_PIN_RESET == pinStat)
    {
        pinStat = ADS131M08_read_cs_signal();
    }
    ADS131M08_control_cs_signal(RESET_SIGNAL);

    result = HAL_SPI_TransmitReceive(adcConfM->hspi, adcConfM->txBuf, adcConfM->rxBuf, adcConfM->bufLen, SPI_DEFAULT_TIMEOUT);
    ADS131M08_control_cs_signal(SET_SIGNAL);

    if(sendFlg == SEND_SYSTEM_CMD)
    {
        adcConfM->response = combineBytes(adcConfM->rxBuf[0], adcConfM->rxBuf[1]);
    }
    else if(sendFlg == SEND_REGISTER_CMD)
    {
        adcConfM->sr.mp[adcConfM->regAddr] = regs;
    }

    if(HAL_OK != result)
    {
        ADS131M08_control_cs_signal(SET_SIGNAL);
    }
    else
    {
        // DO NOTHING
    }
    return result;
}




HAL_StatusTypeDef ADS131M08_recv_response(uint16_t cmd, uint16_t addr, uint16_t regs, _sendFlg sendFlg)
{

    uint16_t temp;
    // Initialize buffer to send NULL command
    HAL_StatusTypeDef result = HAL_OK;

    memset(adcConfM->txBuf, 0, adcConfM->bufLen);

