rr3511/ram/ADS131M08_interface_stm32.c
    // Check availablity to send data
    while(GPIO_PIN_RESET == ADS131M08_read_cs_signal())
    {}
    ADS131M08_control_cs_signal(RESET_SIGNAL);




    if(sendFlg == SEND_SYSTEM_CMD)
    {
    	   if(HAL_OK != HAL_SPI_TransmitReceive(adcConfM->hspi, adcConfM->txBuf, adcConfM->rxBuf, adcConfM->bufLen, SPI_DEFAULT_TIMEOUT))
    	    {
    	        return HAL_ERROR;
    	    }
        adcConfM->response = combineBytes(adcConfM->rxBuf[0], adcConfM->rxBuf[1]);

        if(cmd != adcConfM->response)
        {
            return HAL_ERROR;
        }
    }
    else if(sendFlg == SEND_REGISTER_CMD)
    {
//        temp = ADS131M08_REG_COMMAND(cmd,addr);
//        confirmBuf[0] = ADS131M08_UPPER(temp);
//
//        if(confirmBuf[0] != adcConfM->rxBuf[0])
//        {
//            return HAL_ERROR;
//        }
//        else
//        {
    //	 memset(adcConfM->rxBuf, 0, adcConfM->bufLen);

        result = HAL_SPI_TransmitReceive(adcConfM->hspi, adcConfM->txBuf, adcConfM->rxBuf, adcConfM->bufLen, SPI_DEFAULT_TIMEOUT);
        memset(adcConfM->rxBuf, 0, adcConfM->bufLen);
       // result = HAL_SPI_Receive(adcConfM->hspi, adcConfM->rxBuf, adcConfM->bufLen, SPI_DEFAULT_TIMEOUT);
            adcConfM->sr.mp[adcConfM->regAddr] = combineBytes(adcConfM->rxBuf[0], adcConfM->rxBuf[1]);
//        }
//
//        if(regs != adcConfM->sr.mp[adcConfM->regAddr])
//        {
//            return HAL_ERROR;
//        }
    }
    else
    {
        // Do Nothing
    }
    ADS131M08_control_cs_signal(SET_SIGNAL);
    return HAL_OK;

}






//*****************************************************************************
//
//! Updates the registerMap[] array to its default values.
//!
//! \fn void restoreRegisterDefaults(void)
//!
//! NOTES:
//! - If the MCU keeps a copy of the ADS131M0x register settings in memory,
//! then it is important to ensure that these values remain in sync with the
//! actual hardware settings. In order to help facilitate this, this function
//! should be called after powering up or resetting the device (either by
//! hardware pin control or SPI software command).
//!
//! - Reading back all of the registers after resetting the device can
//! accomplish the same result; however, this might be problematic if the
//! device was previously in CRC mode or the WLENGTH was modified, since
//! resetting the device exits these modes. If the MCU is not aware of this
//! mode change, then read register commands will return invalid data due to
//! the expectation of data appearing in a different byte position.
//!
//! \return None.
//
//*****************************************************************************
void restoreRegisterDefaults(void)
{
	 adcConfM->sr.mp[ID_ADDRESS]             =   0x00;               /* NOTE: This a read-only register */
	 adcConfM->sr.mp[STATUS_ADDRESS]         =   STATUS_DEFAULT;
	 adcConfM->sr.mp[MODE_ADDRESS]           =   MODE_DEFAULT;
	 adcConfM->sr.mp[CLOCK_ADDRESS]          =   CLOCK_DEFAULT;
	 adcConfM->sr.mp[GAIN1_ADDRESS]          =   GAIN1_DEFAULT;
	 adcConfM->sr.mp[GAIN2_ADDRESS]          =   GAIN2_DEFAULT;
	 adcConfM->sr.mp[CFG_ADDRESS]            =   CFG_DEFAULT;
	 adcConfM->sr.mp[THRSHLD_MSB_ADDRESS]    =   THRSHLD_MSB_DEFAULT;
	 adcConfM->sr.mp[THRSHLD_LSB_ADDRESS]    =   THRSHLD_LSB_DEFAULT;
	 adcConfM->sr.mp[CH0_CFG_ADDRESS]        =   CH0_CFG_DEFAULT;
	 adcConfM->sr.mp[CH0_OCAL_MSB_ADDRESS]   =   CH0_OCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH0_OCAL_LSB_ADDRESS]   =   CH0_OCAL_LSB_DEFAULT;
	 adcConfM->sr.mp[CH0_GCAL_MSB_ADDRESS]   =   CH0_GCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH0_GCAL_LSB_ADDRESS]   =   CH0_GCAL_LSB_DEFAULT;
#if (CHANNEL_COUNT > 1)
	 adcConfM->sr.mp[CH1_CFG_ADDRESS]        =   CH1_CFG_DEFAULT;
	 adcConfM->sr.mp[CH1_OCAL_MSB_ADDRESS]   =   CH1_OCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH1_OCAL_LSB_ADDRESS]   =   CH1_OCAL_LSB_DEFAULT;
	 adcConfM->sr.mp[CH1_GCAL_MSB_ADDRESS]   =   CH1_GCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH1_GCAL_LSB_ADDRESS]   =   CH1_GCAL_LSB_DEFAULT;
#endif
#if (CHANNEL_COUNT > 2)
	 adcConfM->sr.mp[CH2_CFG_ADDRESS]        =   CH2_CFG_DEFAULT;
	 adcConfM->sr.mp[CH2_OCAL_MSB_ADDRESS]   =   CH2_OCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH2_OCAL_LSB_ADDRESS]   =   CH2_OCAL_LSB_DEFAULT;
	 adcConfM->sr.mp[CH2_GCAL_MSB_ADDRESS]   =   CH2_GCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH2_GCAL_LSB_ADDRESS]   =   CH2_GCAL_LSB_DEFAULT;
#endif
#if (CHANNEL_COUNT > 3)
	 adcConfM->sr.mp[CH3_CFG_ADDRESS]        =   CH3_CFG_DEFAULT;
	 adcConfM->sr.mp[CH3_OCAL_MSB_ADDRESS]   =   CH3_OCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH3_OCAL_LSB_ADDRESS]   =   CH3_OCAL_LSB_DEFAULT;
	 adcConfM->sr.mp[CH3_GCAL_MSB_ADDRESS]   =   CH3_GCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH3_GCAL_LSB_ADDRESS]   =   CH3_GCAL_LSB_DEFAULT;
#endif
#if (CHANNEL_COUNT > 4)
	 adcConfM->sr.mp[CH4_CFG_ADDRESS]        =   CH4_CFG_DEFAULT;
	 adcConfM->sr.mp[CH4_OCAL_MSB_ADDRESS]   =   CH4_OCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH4_OCAL_LSB_ADDRESS]   =   CH4_OCAL_LSB_DEFAULT;
	 adcConfM->sr.mp[CH4_GCAL_MSB_ADDRESS]   =   CH4_GCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH4_GCAL_LSB_ADDRESS]   =   CH4_GCAL_LSB_DEFAULT;
#endif
#if (CHANNEL_COUNT > 5)
	 adcConfM->sr.mp[CH5_CFG_ADDRESS]        =   CH5_CFG_DEFAULT;
	 adcConfM->sr.mp[CH5_OCAL_MSB_ADDRESS]   =   CH5_OCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH5_OCAL_LSB_ADDRESS]   =   CH5_OCAL_LSB_DEFAULT;
	 adcConfM->sr.mp[CH5_GCAL_MSB_ADDRESS]   =   CH5_GCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH5_GCAL_LSB_ADDRESS]   =   CH5_GCAL_LSB_DEFAULT;
#endif
#if (CHANNEL_COUNT > 6)
	 adcConfM->sr.mp[CH6_CFG_ADDRESS]        =   CH6_CFG_DEFAULT;
	 adcConfM->sr.mp[CH6_OCAL_MSB_ADDRESS]   =   CH6_OCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH6_OCAL_LSB_ADDRESS]   =   CH6_OCAL_LSB_DEFAULT;
	 adcConfM->sr.mp[CH6_GCAL_MSB_ADDRESS]   =   CH6_GCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH6_GCAL_LSB_ADDRESS]   =   CH6_GCAL_LSB_DEFAULT;
#endif
#if (CHANNEL_COUNT > 7)
	 adcConfM->sr.mp[CH7_CFG_ADDRESS]        =   CH7_CFG_DEFAULT;
	 adcConfM->sr.mp[CH7_OCAL_MSB_ADDRESS]   =   CH7_OCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH7_OCAL_LSB_ADDRESS]   =   CH7_OCAL_LSB_DEFAULT;
	 adcConfM->sr.mp[CH7_GCAL_MSB_ADDRESS]   =   CH7_GCAL_MSB_DEFAULT;
	 adcConfM->sr.mp[CH7_GCAL_LSB_ADDRESS]   =   CH7_GCAL_LSB_DEFAULT;
#endif
	 adcConfM->sr.mp[REGMAP_CRC_ADDRESS]     =   REGMAP_CRC_DEFAULT;
}



//****************************************************************************
//
// Helper functions
//
//****************************************************************************

void ADS131M08_receive_data()
{
    ADS131M08_control_cs_signal(RESET_SIGNAL);
    HAL_SPI_Receive_DMA(adcConfM->hspi, adcConfM->rxBuf, adcConfM->bufLen);
}





//*****************************************************************************
//
//! Takes a 16-bit word and returns the most-significant byte.
//!
//! \fn uint8_t upperByte(uint16_t uint16_Word)
//!
//! \param temp_word is the original 16-bit word.
//!
//! \return 8-bit most-significant byte.
//
//*****************************************************************************
uint8_t upperByte(uint16_t uint16_Word)
{
    uint8_t msByte;
    msByte = (uint8_t) ((uint16_Word >> 8) & 0x00FF);

    return msByte;
}



//*****************************************************************************
//
//! Takes a 16-bit word and returns the least-significant byte.
//!
//! \fn uint8_t lowerByte(uint16_t uint16_Word)
//!
//! \param temp_word is the original 16-bit word.
//!
//! \return 8-bit least-significant byte.
//
//*****************************************************************************
uint8_t lowerByte(uint16_t uint16_Word)
{
    uint8_t lsByte;
    lsByte = (uint8_t) (uint16_Word & 0x00FF);

    return lsByte;
}

uint32_t ADS131M08_convert_adc_data(const uint8_t* dataBuf)
{
    uint32_t upperByte;
    uint32_t middleByte;
    uint32_t lowerByte;

    // The output data extends to 32 bits with eight zeroes(0b00000000, 1Byte) added to the least significant bits when using the 32-bit device word length setting, datasheet 38p
    upperByte    = ((uint32_t) dataBuf[0] << 16);
    middleByte   = ((uint32_t) dataBuf[1] << 8);
    lowerByte  = ((uint32_t) dataBuf[2] << 0);

    return (upperByte | middleByte | lowerByte);
}


void ADS131M08_parse_adc_data()
{

